//: [Previous](@previous)

import Foundation
/*
 
 문제 설명
 점심시간에 도둑이 들어, 일부 학생이 체육복을 도난당했습니다.
 다행히 여벌 체육복이 있는 학생이 이들에게 체육복을 빌려주려 합니다.
 학생들의 번호는 체격 순으로 매겨져 있어, 바로 앞번호의 학생이나 바로 뒷번호의 학생에게만 체육복을 빌려줄 수 있습니다.
 예를 들어, 4번 학생은 3번 학생이나 5번 학생에게만 체육복을 빌려줄 수 있습니다. 체육복이 없으면 수업을 들을 수 없기 때문에 체육복을 적절히 빌려 최대한 많은 학생이 체육수업을 들어야 합니다.
 전체 학생의 수 n, 체육복을 도난당한 학생들의 번호가 담긴 배열 lost, 여벌의 체육복을 가져온 학생들의 번호가 담긴 배열 reserve가 매개변수로 주어질 때, 체육수업을 들을 수 있는 학생의 최댓값을 return 하도록 solution 함수를 작성해주세요.
 
 제한사항
 전체 학생의 수는 2명 이상 30명 이하입니다.
 체육복을 도난당한 학생의 수는 1명 이상 n명 이하이고 중복되는 번호는 없습니다.
 여벌의 체육복을 가져온 학생의 수는 1명 이상 n명 이하이고 중복되는 번호는 없습니다.
 여벌 체육복이 있는 학생만 다른 학생에게 체육복을 빌려줄 수 있습니다.
 여벌 체육복을 가져온 학생이 체육복을 도난당했을 수 있습니다. 이때 이 학생은 체육복을 하나만 도난당했다고 가정하며, 남은 체육복이 하나이기에 다른 학생에게는 체육복을 빌려줄 수 없습니다.
 
 입출력 예
 n    lost      reserve      return
 5    [2, 4]    [1, 3, 5]    5
 5    [2, 4]    [3]          4
 3    [3]       [1]          2
 
 입출력 예 설명
 예제 #1
 1번 학생이 2번 학생에게 체육복을 빌려주고, 3번 학생이나 5번 학생이 4번 학생에게 체육복을 빌려주면 학생 5명이 체육수업을 들을 수 있습니다.
 예제 #2
 3번 학생이 2번 학생이나 4번 학생에게 체육복을 빌려주면 학생 4명이 체육수업을 들을 수 있습니다.
 
 */

// MARK:- 나의 풀이
func solution(_ n:Int, _ lost:[Int], _ reserve:[Int]) -> Int {
    //1. 전체 학생수 만큼의 크기의 배열에 각각 element를 1을 할당, 첫 ,마지막 인덱스를 추가하여 0
    var arr = Array(repeating: 1, count: n+2)
    arr[0] = 0
    arr[n+1] = 0
    //2. 여벌의 체육복을 가져온 학생에 +1
    reserve.forEach {
        arr[$0] += 1
    }
    //3. 도난당한 학생의 index에는 element를 -1
    lost.forEach {
        arr[$0] -= 1
    }
    //4. 도난당한 학생에 근접한 학생중 element가 2인 학생이 있다면 빌려옴
    for i in 1...n {
        if arr[i] == 0 {
            if arr[i-1] == 2 {
                arr[i] += 1
                arr[i-1] -= 1
            } else if arr[i+1] == 2{
                arr[i] += 1
                arr[i+1] -= 1
            }
        }
    }
    
    // 결과계산
    var result = 0
    for i in 1...n {
        if arr[i] >= 1{
            result += 1
        }
    }
    return result
}

solution(5, [2,4], [1,3,5])
solution(5, [2,4], [3])
solution(3, [3], [1])

//: [Next](@next)
